{
  "modelName": "DevAccountAccess",
  "rootElement": "DevAccountAccess",
  "description": "Maps team-specific SSO groups (e.g., ABC_BOOMI_FLOW_DEVTEAMA) to dev sub-account IDs. Controls which dev accounts a user can access based on their team group membership. Tier-level access (CONTRIBUTOR, ADMIN) is resolved at runtime from SSO group names in Process A0 — not stored in DataHub. Manually managed by administrators.",
  "fields": [
    {
      "name": "ssoGroupId",
      "type": "String",
      "description": "Azure AD group object ID or canonical group name",
      "required": true,
      "matchField": true
    },
    {
      "name": "ssoGroupName",
      "type": "String",
      "description": "Human-readable Azure AD group display name",
      "required": true,
      "matchField": false
    },
    {
      "name": "devAccountId",
      "type": "String",
      "description": "Boomi dev sub-account ID that this group can promote from",
      "required": true,
      "matchField": true
    },
    {
      "name": "devAccountName",
      "type": "String",
      "description": "Human-readable dev account name for display purposes",
      "required": true,
      "matchField": false
    },
    {
      "name": "isActive",
      "type": "String",
      "description": "Enable/disable access without deleting record (values: 'true' or 'false')",
      "required": true,
      "matchField": false
    }
  ],
  "matchRules": [
    {
      "type": "EXACT",
      "description": "Compound match on SSO group ID and dev account ID (one group can access multiple accounts)",
      "fields": ["ssoGroupId", "devAccountId"]
    }
  ],
  "sources": [
    {
      "name": "ADMIN_CONFIG",
      "type": "contribute-only",
      "description": "Manually seeded and maintained by system administrators via DataHub API"
    }
  ],
  "dataQualitySteps": [],
  "notes": "This model provides the team-axis of the two-axis SSO authorization model. Team groups (ABC_BOOMI_FLOW_DEVTEAM*) determine which dev accounts a user can access; tier groups (ABC_BOOMI_FLOW_CONTRIBUTOR, ABC_BOOMI_FLOW_ADMIN) determine dashboard access level and are resolved at runtime in Process A0. ADMIN tier bypasses the team check and sees all active DevAccountAccess records. Non-dashboard tiers (READONLY, OPERATOR) never reach this model because they cannot access the Flow dashboard. Multiple team groups can map to the same account, and one group can access multiple accounts."
}
